performance_test_results_k6_grafana/k6-results/scalability_test - place_order.txt
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /src/services/rest/test_runner.js
        output: InfluxDBv1 (http://influxdb:8086)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 38m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 38m0s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✗ Status is 200
      ↳  99% — ✓ 185734 / ✗ 1037

     checks.........................: 99.44% 185734 out of 186771
     data_received..................: 85 MB  37 kB/s
     data_sent......................: 49 MB  22 kB/s
     http_req_blocked...............: avg=6.3µs    min=875ns  med=3.37µs   max=9.39ms  p(90)=9.45µs  p(95)=17.5µs  
     http_req_connecting............: avg=423ns    min=0s     med=0s       max=4.17ms  p(90)=0s      p(95)=0s      
   ✓ http_req_duration..............: avg=625.86µs min=54.2µs med=371.62µs max=47.82ms p(90)=1.26ms  p(95)=2.1ms   
       { expected_response:true }...: avg=620.68µs min=54.2µs med=370.16µs max=47.82ms p(90)=1.24ms  p(95)=2.08ms  
   ✓ http_req_failed................: 0.55%  1037 out of 186771
     http_req_receiving.............: avg=37.52µs  min=5µs    med=23.33µs  max=10.37ms p(90)=75.2µs  p(95)=110.79µs
     http_req_sending...............: avg=24.46µs  min=2.66µs med=10.29µs  max=15.04ms p(90)=41.91µs p(95)=79.79µs 
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=563.88µs min=0s     med=325.66µs max=46.35ms p(90)=1.13ms  p(95)=1.91ms  
     http_reqs......................: 186771 81.886093/s
     iteration_duration.............: avg=1s       min=1s     med=1s       max=1.81s   p(90)=1.01s   p(95)=1.01s   
     iterations.....................: 186771 81.886093/s
     vus............................: 1      min=1                max=200
     vus_max........................: 200    min=200              max=200


running (38m00.9s), 000/200 VUs, 186771 complete and 0 interrupted iterations
default ✓ [======================================] 000/200 VUs  38m0s