performance_test_results_k6_grafana/k6-results/stress_test - place_order.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /src/services/rest/test_runner.js
        output: InfluxDBv1 (http://influxdb:8086)

     scenarios: (100.00%) 1 scenario, 100 max VUs, 37m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 37m0s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✗ Status is 200
      ↳  99% — ✓ 105074 / ✗ 856
     checks.........................: 99.19% 105074 out of 105930
     data_received..................: 48 MB  22 kB/s
     data_sent......................: 28 MB  13 kB/s
     http_req_blocked...............: avg=8.08µs   min=875ns   med=4.2µs    max=14.81ms p(90)=14.91µs p(95)=24µs   
     http_req_connecting............: avg=495ns    min=0s      med=0s       max=14.59ms p(90)=0s      p(95)=0s     
   ✓ http_req_duration..............: avg=757.51µs min=48.04µs med=459.58µs max=77.79ms p(90)=1.84ms  p(95)=2.45ms 
       { expected_response:true }...: avg=747.88µs min=48.04µs med=457.68µs max=77.79ms p(90)=1.8ms   p(95)=2.42ms 
   ✓ http_req_failed................: 0.80%  856 out of 105930
     http_req_receiving.............: avg=45.23µs  min=5.08µs  med=30.54µs  max=7.29ms  p(90)=90.29µs p(95)=128.7µs
     http_req_sending...............: avg=28.59µs  min=2.75µs  med=13.12µs  max=5.66ms  p(90)=64.79µs p(95)=91.66µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s      p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=683.67µs min=0s      med=405.62µs max=77.77ms p(90)=1.68ms  p(95)=2.25ms 
     http_reqs......................: 105930 47.695125/s
     iteration_duration.............: avg=1s       min=1s      med=1s       max=1.51s   p(90)=1.01s   p(95)=1.01s  
     iterations.....................: 105930 47.695125/s
     vus............................: 1      min=1                max=100
     vus_max........................: 100    min=100              max=100


running (37m01.0s), 000/100 VUs, 105930 complete and 0 interrupted iterations
default ✓ [======================================] 000/100 VUs  37m0s